Objetos do tipo index são imutáveis. Essa característica faz com que seja mais seguro o compartilhamento de objetos index com estruturas de dados.

In [1]:
import pandas as pd
import numpy as np

i = pd.Index(np.arange(3))
dados = pd.Series(['a','b','c'], index=i)
dados, dados.ndim

(0    a
 1    b
 2    c
 dtype: object, 1)

Os index em Pandas podem ser duplicados!

In [3]:
i = pd.Index([1,1,2,2])
a = pd.Series(np.arange(4), index=i)
a

1    0
1    1
2    2
2    3
dtype: int64

Reindex - Podemos alterar a ordem dos índices:

In [3]:
a = pd.Series([6,4,3,9],index=['c','a','d','b'])
a

c    6
a    4
d    3
b    9
dtype: int64

In [11]:
a.reindex(['a','b','c','d','e'])

a    4.0
b    9.0
c    6.0
d    3.0
e    NaN
dtype: float64

Podemos preencher os valores em caso de ausência com "fill_value":

In [15]:
dados = pd.Series(['v1','v2','v3'], index=[1,2,3])
i = pd.Index([5,4,3,2,1])
dados.reindex(index=i,fill_value='nondefined')

5    nondefined
4    nondefined
3            v3
2            v2
1            v1
dtype: object

Podemos deletar linhas (axis=0) ou colunas (axis=1) com o comando drop:

In [26]:
dados = pd.DataFrame({'nome': ['Julia','Alan','Marcela'],
                    'idade': [11,18,21],
                    'genero':  ['f','m','f']})
dados

      nome  idade genero
0    Julia     11      f
1     Alan     18      m
2  Marcela     21      f

In [27]:
dados.drop('genero',axis=1)
dados.drop(0) #Para apagar linhas, é necessário apenas o rótulo/índice

      nome  idade genero
1     Alan     18      m
2  Marcela     21      f

Fatiamento: Para selecionar um intervalo de valores específicos, usamos o fatiamento. Além disso, é possível alterar os valores dos respectivos rótulos que se desejam retornar:

In [30]:
numbers = pd.Series([11,22,33,44,55,66])
numbers[0:3]

0    11
1    22
2    33
dtype: int64

In [34]:
numbers[0:3] = 'null'
numbers

0    null
1    null
2    null
3      44
4      55
5      66
dtype: object

Indexação: Se refere ao ato de retornar colunas específicas:

In [9]:
dados = pd.DataFrame({'Nomes': ['Julia','Amanda','Carla','Mateus','Luana','Leticia'],
                     'Idade': [17,16,20,32,54,12],
                     'Nota': [10,2,7,8.5,10,5]})
dados[['Nomes','Nota']]

     Nomes  Nota
0    Julia  10.0
1   Amanda   2.0
2    Carla   7.0
3   Mateus   8.5
4    Luana  10.0
5  Leticia   5.0

In [10]:
dados[dados['Nota']>7]

    Nomes  Idade  Nota
0   Julia     17  10.0
3  Mateus     32   8.5
4   Luana     54  10.0

In [11]:
dados['Situação'] = np.where(dados['Nota']>=5,'Aprovado','Reprovado')
dados

     Nomes  Idade  Nota   Situação
0    Julia     17  10.0   Aprovado
1   Amanda     16   2.0  Reprovado
2    Carla     20   7.0   Aprovado
3   Mateus     32   8.5   Aprovado
4    Luana     54  10.0   Aprovado
5  Leticia     12   5.0   Aprovado